nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/mcpwm/processor/mcpwm_p32mk1024mcf064.h
} MCPWM_CURRENTLIMIT_SOURCE;

typedef enum {

    MCPWM_CURRENTLIMIT_INPUT_POLARITY_ACTIVE_HIGH = 0,
    MCPWM_CURRENTLIMIT_INPUT_POLARITY_ACTIVE_LOW = 1

} MCPWM_CURRENTLIMIT_INPUT_POLARITY;

typedef enum {

    MCPWM_CURRENTLIMIT_OVERRIDE_PWMxH_0 = 0,
    MCPWM_CURRENTLIMIT_OVERRIDE_PWMxH_1 = 1

} MCPWM_CURRENTLIMIT_OVERRIDE_PWMxH_VALUE;

typedef enum {

    MCPWM_CURRENTLIMIT_OVERRIDE_PWMxL_0 = 0,
    MCPWM_CURRENTLIMIT_OVERRIDE_PWMxL_1 = 1

} MCPWM_CURRENTLIMIT_OVERRIDE_PWMxL_VALUE;

typedef enum {

    MCPWM_CURRENTLIMIT_DISABLE = 0,
    MCPWM_STANDARD_CURRENT_LIMIT_MODE_ENABLE = 1,
    MCPWM_XPRES_CURRENT_LIMIT_MODE_ENABLE = 2

} MCPWM_CURRENTLIMIT_MODE;

typedef enum {

    MCPWM_FAULT_SOURCE_IS_FLT1 = 0,
    MCPWM_FAULT_SOURCE_IS_FLT2 = 1,
    MCPWM_FAULT_SOURCE_IS_FLT3 = 2,
    MCPWM_FAULT_SOURCE_IS_FLT4 = 3,
    MCPWM_FAULT_SOURCE_IS_FLT5 = 4,
    MCPWM_FAULT_SOURCE_IS_FLT6 = 5,
    MCPWM_FAULT_SOURCE_IS_FLT7 = 6,
    MCPWM_FAULT_SOURCE_IS_FLT8 = 7,
    MCPWM_FAULT_SOURCE_IS_COMPARATOR1 = 8,
    MCPWM_FAULT_SOURCE_IS_COMPARATOR2 = 9,
    MCPWM_FAULT_SOURCE_IS_COMPARATOR3 = 10,
    MCPWM_FAULT_SOURCE_IS_COMPARATOR4 = 11,
    MCPWM_FAULT_SOURCE_IS_COMPARATOR5 = 12,
    MCPWM_FAULT_SOURCE_IS_FLT15 = 15

} MCPWM_FAULT_SOURCE;

typedef enum {

    MCPWM_FAULT_INPUT_POLARITY_ACTIVE_HIGH = 0,
    MCPWM_FAULT_INPUT_POLARITY_ACTIVE_LOW = 1

} MCPWM_FAULT_INPUT_POLARITY;

typedef enum {

    MCPWM_FAULT_OVERRIDE_PWMxH_0 = 0,
    MCPWM_FAULT_OVERRIDE_PWMxH_1 = 1

} MCPWM_FAULT_OVERRIDE_PWMxH_VALUE;

typedef enum {

    MCPWM_FAULT_OVERRIDE_PWMxL_0 = 0,
    MCPWM_FAULT_OVERRIDE_PWMxL_1 = 1

} MCPWM_FAULT_OVERRIDE_PWMxL_VALUE;

typedef enum {

    MCPWM_FAULT_MODE_LATCHED = 0,
    MCPWM_FAULT_MODE_CYCLE_BY_CYCLE = 1,
    MCPWM_FAULT_MODE_DISABLED = 3

} MCPWM_FAULT_MODE;

typedef enum {

    MCPWM_OVERRIDE_PWMxH_0 = 0,
    MCPWM_OVERRIDE_PWMxH_1 = 1

} MCPWM_OVERRIDE_PWMxH_VALUE;

typedef enum {

    MCPWM_OVERRIDE_PWMxL_0 = 0,
    MCPWM_OVERRIDE_PWMxL_1 = 1

} MCPWM_OVERRIDE_PWMxL_VALUE;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/mcpwm_ModuleControl_Default.h"
#include "../templates/mcpwm_PrimarySpecialEventTrigger_Default.h"
#include "../templates/mcpwm_SecondarySpecialEventTrigger_Default.h"
#include "../templates/mcpwm_PrimaryTimerSetup_Default.h"
#include "../templates/mcpwm_SecondaryTimerSetup_Default.h"
#include "../templates/mcpwm_ChopClockSetup_Default.h"
#include "../templates/mcpwm_ChannelSetup_Default.h"
#include "../templates/mcpwm_ChannelPrimaryDutyCycleSet_Default.h"
#include "../templates/mcpwm_ChannelSecondaryDutyCycleSet_Default.h"
#include "../templates/mcpwm_ChannelPhaseSet_Default.h"
#include "../templates/mcpwm_ChannelDeadtimeSetup_Default.h"
#include "../templates/mcpwm_ChannelTrigger_Default.h"
#include "../templates/mcpwm_ChannelCurrentLimit_Default.h"
#include "../templates/mcpwm_ChannelFault_Default.h"
#include "../templates/mcpwm_ChannelChopSetup_Default.h"
#include "../templates/mcpwm_ChannelLEBSetup_Default.h"
#include "../templates/mcpwm_ChannelPeriodResetInterrupt_Default.h"
#include "../templates/mcpwm_ChannelPeriodMatchInterrupt_Default.h"
#include "../templates/mcpwm_ChannelOverrideSetup_Default.h"
#include "../templates/mcpwm_ChannelGeneralFunctions_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_MCPWM_Enable(MCPWM_MODULE_ID index)
{
     MCPWM_Enable_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_Disable(MCPWM_MODULE_ID index)
{
     MCPWM_Disable_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_StopInIdleEnable(MCPWM_MODULE_ID index)
{
     MCPWM_StopInIdleEnable_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_StopInIdleDisable(MCPWM_MODULE_ID index)
{
     MCPWM_StopInIdleDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_MCPWM_ModuleIsReady(MCPWM_MODULE_ID index)
{
     return MCPWM_ModuleIsReady_Default(index);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsModuleControl(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsModuleControl_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_PrimarySpecialEventTriggerSetup(MCPWM_MODULE_ID index, uint16_t compare_value, MCPWM_TRIGGER_DIVIDER postscaler_value)
{
     MCPWM_PrimarySpecialEventTriggerSetup_Default(index, compare_value, postscaler_value);
}

PLIB_INLINE_API bool PLIB_MCPWM_PrimarySpecialEventTriggerInterruptIsPending(MCPWM_MODULE_ID index)
{
     return MCPWM_PrimarySpecialEventTriggerInterruptIsPending_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_PrimarySpecialEventTriggerInterruptEnable(MCPWM_MODULE_ID index)
{
     MCPWM_PrimarySpecialEventTriggerInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_PrimarySpecialEventTriggerInterruptDisable(MCPWM_MODULE_ID index)
{
     MCPWM_PrimarySpecialEventTriggerInterruptDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsPrimarySpecialEventTrigger(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsPrimarySpecialEventTrigger_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_SecondarySpecialEventTriggerSetup(MCPWM_MODULE_ID index, uint16_t compare_value, MCPWM_TRIGGER_DIVIDER postscaler_value)
{
     MCPWM_SecondarySpecialEventTriggerSetup_Default(index, compare_value, postscaler_value);
}

PLIB_INLINE_API bool PLIB_MCPWM_SecondarySpecialEventTriggerInterruptIsPending(MCPWM_MODULE_ID index)
{
     return MCPWM_SecondarySpecialEventTriggerInterruptIsPending_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_SecondarySpecialEventTriggerInterruptEnable(MCPWM_MODULE_ID index)
{
     MCPWM_SecondarySpecialEventTriggerInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_SecondarySpecialEventTriggerInterruptDisable(MCPWM_MODULE_ID index)
{
     MCPWM_SecondarySpecialEventTriggerInterruptDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsSecondarySpecialEventTrigger(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsSecondarySpecialEventTrigger_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_PrimaryTimerSetup(MCPWM_MODULE_ID index, MCPWM_CLOCK_DIVIDER clock_div, uint16_t period_value)
{
     MCPWM_PrimaryTimerSetup_Default(index, clock_div, period_value);
}

PLIB_INLINE_API uint16_t PLIB_MCPWM_PrimaryTimerCountRead(MCPWM_MODULE_ID index)
{
     return MCPWM_PrimaryTimerCountRead_Default(index);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsPrimaryTimerSetup(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsPrimaryTimerSetup_Default(index);
}

