nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/mcpwm/processor/mcpwm_p32mk1024mcf064.h
PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelPeriodResetInterrupt(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelPeriodResetInterrupt_Default(index);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelPeriodMatchInterruptIsPending(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelPeriodMatchInterruptIsPending_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelPeriodMatchInterruptIsEnabled(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelPeriodMatchInterruptIsEnabled_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPeriodMatchInterruptFlagClear(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPeriodMatchInterruptFlagClear_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPeriodMatchInterruptEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPeriodMatchInterruptEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPeriodMatchInterruptDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPeriodMatchInterruptDisable_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelPeriodMatchInterrupt(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelPeriodMatchInterrupt_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPWMxHOverrideEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPWMxHOverrideEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPWMxHOverrideDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPWMxHOverrideDisable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPWMxLOverrideEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPWMxLOverrideEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPWMxLOverrideDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPWMxLOverrideDisable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelOverrideOutputSet(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, MCPWM_OVERRIDE_PWMxH_VALUE override_pwmh_value, MCPWM_OVERRIDE_PWMxL_VALUE override_pwml_value)
{
     MCPWM_ChannelOverrideOutputSet_Default(index, channel, override_pwmh_value, override_pwml_value);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelSyncOverrideAtPeriodBoundary(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelSyncOverrideAtPeriodBoundary_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelSyncOverrideAtCPUClockBoundary(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelSyncOverrideAtCPUClockBoundary_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelOverrideSetup(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelOverrideSetup_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_MCPWM_ChannelLocalPWMTimerCountRead(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelLocalPWMTimerCountRead_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_IOCONxUnlock(MCPWM_MODULE_ID index)
{
     MCPWM_IOCONxUnlock_Default(index);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelTimerDirectionGet(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelTimerDirectionGet_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPWMxHEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPWMxHEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPWMxHDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPWMxHDisable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPWMxLEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPWMxLEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPWMxLDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelPWMxLDisable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelSwapHighLowEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelSwapHighLowEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelSwapHighLowDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelSwapHighLowDisable_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelGeneralFunctions(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelGeneralFunctions_Default(index);
}

#endif
